Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/facta/skuvlahistorja4/juhan-s.htm.tmx
Source language: sme
Languages: nob

source: På norsk
nob: Sámegillii

source: Artihkal girjjis Sámi skuvlahistorjá 4 Davvi Girji 2010 .
nob: Artikkel i boka Samisk skolehistorie 4 . Davvi Girji 2010 .

source: Kárášjogas bealjehemiid skuvlii 2002:s
nob: Fra Karasjok til døveskole i 2002

source: Muitaluvvon Kristin Sarai
nob: Fortalt til Kristin Sara

source: Juhan Niillas Eira ( Govva : Linn Sophie Helmersen )
nob: Juhan Niillas Eira ( Foto : Linn Sophie Helmersen )

source: Juhan Niillas Eira lea riegádan Kárášjogas 1989:s , boazodoallobearrašis .
nob: Juhan Niillas Eira er født i Karasjok i 1989 , i en reindriftsfamilie .

source: Son váccii ruovttugielddas mánáidgárddi ja mánáidskuvlla .
nob: Han gikk barnehage og barneskole i hjemkommunen .

source: Álggahettiin nuoraidskuvlla son fárrii bearrašiinnis Troandimii vai sáhtii vázzit A. C. Møller skuvllas , bealjehemiid vuođđoskuvllas .
nob: Ved overgangen til ungdomsskolen flyttet han og familien til Trondheim , slik at han kunne gå på A. C. Møller skole , grunnskole for døve .

source: Maŋŋil son lea ollašuhttán joatkkaskuvlla Troandimis huksejeaddjin , dulkka bokte .
nob: Senere har han fullført tømrerlinja ved videregående skole i Trondheim .

source: Son lea maid vázzán jagi bealjehis olbmuid álbmotallaskuvllas .
nob: Han har også gått et år på folkehøyskole for døve .

source: Dál ( 2009 ) son lea ohcamin oahpahallisaji vai sáhttá fidnet fágareivve .
nob: For tida ( 2009 ) er han på utkikk etter lærlingplass slik at han kan få fagbrev .

source: Kristin Sara lei bealjehemiiddulka ja mearkagielaoahpaheaddji Juhan Niillas Eirai Kárášjogas jagiid 1995–2002 .
nob: Kristin Sara var døvetolk og tegnspråklærer for Juhan Niillas Eira i Karasjok i tida 1995–2002 .

source: Su birra lea lagabui muitaluvvon ovddit artihkkalis .
nob: Hun er nærmere presentert i forrige artikkel .

source: Lean riegádan bealjeheapmin ja ásan ovttas váhnemiiddánguin , stuora vieljainan ja unna oappáinan .
nob: – Jeg er født døv og jeg bor sammen med mine foreldre , min storebror og min lillesøster .

source: Goappašagat mu váhnemiin leaba oahppan mearkagiela .
nob: Begge mine foreldre har lært seg tegnspråk .

source: Mu oabbá ja vielja atniba njálmmelihkastagaid , mearkkaid , seavvima ja čujuheami .
nob: Mine søsken bruker munnavlesning , tegn , gester og peking .

source: Ja mus lea muoŧŧá ja ipmi geat oahpaiga mearkagiela .
nob: Og det er to tanter av meg som har lært seg tegnspråk .

source: Eará fuolkkit dahket nugo mu oarbinaččat .
nob: Resten av slekta gjør slik som mine søsken .

source: Dat gal manná bures .
nob: Det går greit .

source: Buohkat sámástit dieđusge , ja mun sáhtán oalle álkit lohkat njálmmi lihkastagaid jus dovddan dan olbmo .
nob: Alle prater samisk selvfølgelig , og jeg kan munnavlese det ganske greit hvis jeg kjenner personen .

source: Muhto lea álo váttis , ja dávjá badjánit dilit goas in ádde .
nob: Men det er alltid vanskelig , så det oppstår ofte situasjoner som jeg ikke forstår .

source: Buot váddáseamos lea singuin geaiguin in servvoštala beaivválaččat .
nob: Det er vanskeligst med dem jeg ikke omgås til hverdags .

source: Dalle ferten čájehit sidjiide maid oaivvildan manadettiin dan báikái , ja sáhtán maid sárgut dahje geahččalit čállit .
nob: Da må jeg vise dem hva jeg mener ved å gå til det stedet , og jeg kan også tegne eller prøve meg på å skrive .

source: Muhto in leat čeahppi čállit dahje lohkat dárogiela .
nob: Men jeg er ikke flink til å skrive eller lese norsk .

source: Lea váddáseappo lohkat ja čállit sámegiela go dárogiela .
nob: Det er vanskeligere å lese og skrive samisk enn norsk .

source: Buoremusat gulahalan mearkagillii .
nob: Jeg kommuniserer best på tegnspråk .

source: Gávnnahuvvui bealjeheapmin jahkásažžan
nob: Konstatert døv da jeg var ett år

source: – Go ledjen jahkásaš de gávnnahuvvui ahte lean bealjeheapmi , dahje lossagulot nugo sii dadje .
nob: – Da jeg var ett år gammel ble det konstatert at jeg var døv , eller hørselshemmet som de sa .

source: Lei dábálaš dearvvašvuođa iskkadeami bokte .
nob: Det var gjennom vanlig helsekontroll .

source: Gielda bijahii johtui fierpmádatkurssa oahppan dihte mearkagiela .
nob: Kommunen fikk i gang nettverkskurs for lære tegnspråk .

source: Kurssas ledje sihke bearaš , fuolkkit ja mánáidgárddi ja skuvlla bargit .
nob: På kurset var det både familie , slektninger og ansatte i barnehage og skole .

source: Muhto ođđa giela oahppan lea sihke váttis ja áddjái .
nob: Men å lære et helt nytt språk er jo vanskelig og det tar tid .

source: Mu váhnenguovttos fertiiga oahppat áibbas ođđa giela vai sáhtiiga muinna gulahallat .
nob: Mine foreldre måtte lære seg et helt nytt språk for å kommunisere med meg .

source: Lei vissásit amas sudnuide .
nob: Det var sikkert rart for dem.

source: Mu bearaš álggii johtit Ål álbmotallaskuvllas , bealjehemiid kursaguovddážis ja Møller gealboguovddážis vai sáhtte oahppat bealjehis olbmuin ja mearkagielas nu ollu go vejolaš .
nob: Familien min begynte å reise til Ål folkehøyskole og kurssenter for døve og til Møller kompetansesenter for å lære seg mest mulig om døve og om tegnspråk .

source: Jáhkán lei erenoamáš váttis danne go leimmet sápmelaččat .
nob: Men fordi vi var samer , tror jeg det var ekstra vanskelig .

source: Mearkagiela luoikkaha njálmmi lihkastagaid ja sániid dárogielas .
nob: Tegnspråket låner munnstillinger og ord fra norsk .

source: Ja dat lea iežas giella iežas grammatihkalaš vuogádagain .
nob: Og det er et eget språk med egen grammatisk oppbygging .

source: Ii lean álki sidjiide leat dárobirrasis ja várra vel dárostit muinna mearkkaiguin .
nob: Det var ikke lett for dem å være i et norsk miljø og kanskje prate norsk med tegn til meg .

source: Dan ipmirdan dál rávesolmmožin .
nob: Det skjønner jeg nå som voksen .

source: Ovdal go nu guhkás jovde ahte ohppe mearkagiela , adnojuvvui veahkkegiella .
nob: Før de kom så langt at de lærte seg tegnspråk , var det tale med tegn som ble brukt .

source: Sidjiide lei váttis diehtit galge go sámástit vai dárostit .
nob: Det var vanskelig for dem å vite om de skulle bruke samisk eller norsk .

source: Sis lei maid fuolla das ahte fertešeimmet fárret , vai mun oččošin mearkagielaoahpahusa .
nob: De var også bekymret over at de måtte flytte for at jeg skulle få tegnspråkopplæring .

source: Sii ipmirdedje ahte munnje ii lean vejolaš oahppat sáme- ja dárogiela iešalddis .
nob: De skjønte at det ikke ville være mulig for meg å lære samisk og norsk automatisk .

source: Mun in gullan giela .
nob: Jeg hørte ikke språket .

source: Min čatnasupmi boazodollui lei maid lassi fuollan .
nob: Det var nok også en ekstra bekymring at vi er tilknyttet reindriften .

source: Galggai go luohpat iežas kultuvrras mu dihtii ja álggahit ođđasis áibbas eará báikkis ?
nob: Måtte de gi avkall på sin egen kultur på grunn av meg og starte på nytt et helt annet sted ?

source: Muittán áidna ášši maid mánnán háliidin lei bargat bohccuiguin .
nob: Da jeg var barn kan jeg huske at det eneste jeg ville var å drive med rein .

source: Ja diehttelas beroštin hui ollu muohtaskohteriin .
nob: Og selvfølgelig var jeg veldig opptatt av skuter .

source: Máhtten buot muohtaskohter mearkkaid .
nob: Jeg kunne alle skutermerkene .

source: Odne dieđán ahte mus livččii lean hui lossa dilli boazodoalus go in sáhte gullat .
nob: Jeg vet i dag at det ville vært tungt for meg i reindrifta fordi jeg ikke hører .

source: Doppe eai leat gallis geat máhttet mearkagiela ja mun in sáhte gullat maid earát hállet jus eai geahča njuolgga munnje , vai sáhtán lohkat njálmmi lihkastagaid .
nob: Der er det ikke mange som kan tegnspråk og ikke vil jeg høre hva de andre snakker om hvis de ikke henvender seg direkte til meg slik at jeg kan munnavlese .

source: Ja de fertejit vel oahppat mu áddet .
nob: Og så må jo de også lære seg å forstå meg .

source: Muhto dalle lei dušše boazodoallu mii mearkkašii munnje maidige .
nob: Men den gang var det bare reindrift for meg .

source: Leimmet gándajoavku seammá beroštumiin ja buohkat áigguimet bissut boazodoalus .
nob: Vi var en gjeng gutter med samme interesser og alle skulle bli i reindrifta .

source: Dovden dušše dan dili .
nob: Det var det jeg kjente til .

source: Liikojin buoremusat bearraša mielde duoddaris , erenoamážit go lei mearkun , njuovvan ja rátkin .
nob: Jeg likte best å være med familien på fjellet , spesielt når det var merking , slakting og skilling .

source: Dat lei mu eallin .
nob: Det var livet mitt .

source: Mánáidgárdi
nob: Barnehagen

source: – Go álgen mánáidgárdái ledje doppe muhtun bargit geat máhtte mearkkaid .
nob: – Da jeg begynte i barnehagen var det noen ansatte som kunne tegn .

source: Jáhkán bures loaktán doppe áiggi .
nob: Jeg tror jeg trivdes godt .

source: Mánáidgárddis vázzen guhtta jagi .
nob: Jeg gikk i barnehagen i seks år .

source: Máŋga jagi ovdal lei leamaš muhtin eará bealjehis gánda seammá mánáidgárddis , de sii han dihte juo juoga bealjehemiin go mun álgen dohko .
nob: For mange år siden gikk en døv gutt i den samme barnehagen , så de visste jo noe om døve allerede da jeg begynte .

source: Mánáidgárddis ohppe eará mánát mearkkaid ovttas muinna .
nob: I barnehagen lærte de andre barna tegn sammen med meg .

source: Duhkoradden singuin geat orro seammá geainnus go mun , sáhtiimet gulahallat go gielda vuoruhii mearkagielaoahpahusa .
nob: Jeg lekte med dem som bodde i nabolaget , og vi kunne kommunisere fordi kommunen satset på tegnspråkopplæring .

source: Lei gal eanemusat čujuheapmi ja álkes mearkkat : duhkoraddat , borramuš ja nu ain .
nob: Det var vel mest peking og enkle tegn for leke , mat og så videre .

source: Lei erenoamážit okta mánáidgárddebargi geainna mus lei eanemus oktavuohta , son šattai hui čeahppi mearkagielas ja lei mu mielde astoáiggedoaimmain doarjjaolmmožin .
nob: Det var spesielt en ansatt i barnehagen som jeg hadde mest kontakt med . Han ble god i tegnspråk og var også med meg på fritidsaktiviteter som støttekontakt .

source: Muittán ahte mánáidgárddis ledje plakáhtat mearkkaiguin sierralágán borramušaide , bajožiidda , biktasiidda ja diekkáraččaide .
nob: Jeg husker at det var plakater i barnehagen med tegn for forskjellig mat , pålegg og klær og sånne ting .

source: Muhto dat ledje dárogillii .
nob: Men det sto på norsk .

source: Ja de lei alfabehta .
nob: Og så var det alfabet .

source: Maŋŋil ráhkaduvvui mearkaalfabehta sámegillii .
nob: Senere ble det laget samisk tegnalfabet .

source: Muhtin skuvllas mátkkoštii Møller gealboguovddážii Troandimii ja ráhkadahtii diekkár plakáhta .
nob: Noen fra skolen reiste ned til Møller kompetansesenter i Trondheim og fikk laget et slikt .

source: Ja de dieđán ahte ráhkaduvvui sámegielat mearkavideo bearrašii , sohka ja jagiáiggit .
nob: Og så vet jeg at det også ble laget en samisk tegnvideo for familie , slekt og årstider .

source: Muhto lei maŋŋil go álgen nuoraidskuvlii .
nob: Men det var etter at jeg var begynt på ungdomsskolen .

source: Lea muitaluvvon munnje ahte guovttejahkásažžan ledjen oahppan ollu mearkkaid ja čujuhin tiŋggaid .
nob: Jeg har blitt fortalt at da jeg var to år hadde jeg lært masse tegn og jeg pekte på ting .

source: Mu váhnemiin ledje videofilmmat ja girjjit ruovttus oahppan dihte mearkagiela , dasa lassin oasálasttiiga kurssaide mat gávdnojedje .
nob: Mine foreldre hadde videofilmer og bøker hjemme for å lære seg tegnspråk , i tillegg til at de gikk på de kursene som var .

source: Ieš liikojin govvaráidduide .
nob: Selv likte jeg tegnefilmer .

source: Ja diehttelas Mr. Beanii .
nob: Og selvfølgelig Mr. Bean .

source: Gullanapparáhtta
nob: Høreapparat

source: – Guovttejahkásažžan álgen gullanapparáhtain .
nob: – Jeg begynte med høreapparat da jeg var to år .

source: Dat lei leŋgejuvvon ratti birra ja goallostuvvon bealjeculcciide .
nob: Sjølve apparatet hang i en sele rundt brystet og var koblet på ørepropper .

source: Mu mielas lei suohtas jienain , muhto in liikon apparáhta atnit .
nob: Jeg syntes det var moro med lyd , men jeg likte ikke å bruke det .

source: Dat ii lean vuohkkasat go heŋgii báttiin ratti birra .
nob: Høreapparatet var upraktisk siden det hang i en sele .

source: Go ledjen guđajahkásaš , ožžon gullanapparáhtaid bealjeduohkái , ja dalle dohkkehin daid .
nob: Da jeg var seks år fikk jeg ørehengere og da var det greit med høreapparat .

source: Lean ain sorjavaš dain .
nob: Jeg er fremdeles avhengig av dem.

source: Liikon gullat jienaid iežan birrasis , muhto in gula hállama .
nob: Liker å høre lydene rundt meg , men jeg oppfatter ikke tale .

source: Skuvlii álgin
nob: Skolestart

source: – Skuvllas álgen dárogielat luohkái .
nob: – Jeg begynte i norsktalende klasse på skolen .

source: Eadni guovttos áhčiin leaba muitalan ahte lei dehálaš vai oččošin nu buorre dárogiela- ja mearkagielaoahpahusa go vejolaš .
nob: Mor og far har fortalt at det var viktig at jeg skulle ha så god norsk- og tegnspråkopplæring som mulig .

source: Mátkkoštin bealjehemiid skuvlii máŋgii jagis oanehisáigái ovttas skuvlla oahpaheddjiin .
nob: Jeg reiste til døveskolen flere ganger i året på korttidsopphold sammen med en lærer fra barneskolen .

source: Orrun molsašuttai ovtta vahkus golmma vahkkui .
nob: Oppholdene varierte fra en til tre uker .

source: Orron skuvlaviesus ovttas eará bealjehis mánáiguin ja oahpásmuvven singuin .
nob: Jeg bodde på skolehuset sammen med andre døve barn og ble kjent med dem.

source: Dasa lassin fuobmájin ahte mearkagielas gávdnojit máŋggalágan suopmanat , dat orui álggos veahá ártet .
nob: Dessuten oppdaget jeg at tegnspråk hadde flere dialekter og det var litt rart i begynnelsen .

source: Maŋŋil fárrehuvvojin sámegielat luohkkái danin go mus lea sáme ruovttubiras .
nob: Senere ble jeg flyttet til samisktalende klasse fordi mitt hjemmemiljø er samisk .

source: Lei dehálaš vai in manahivčče gullevašvuođa sámevuhtii .
nob: Det var viktig at jeg ikke skulle miste den samiske tilhørigheten .

source: Dárogielat luohkká lei munnje amas .
nob: Norsktalende klasse var fremmed for meg .

source: Ipmirdin sámegiela mearkagielain ja mu skihpárat vázze dan sámegielat luohkás .
nob: Jeg forsto samisk med tegn og vennene mine gikk i den samisktalende klassen .

source: Singuin ledjen astoáiggis ja sii máhtte muhtun mearkkaid .
nob: Det var dem som jeg hang med i fritiden og de kunne noen tegn .

source: Mii stoagaimet , sihkkelasttiimet , ja muđui finaimet spáppačiekčan- ja čuoiganhárjehallamiin .
nob: Vi lekte , syklet , og ellers gikk vi på fotball- og skitrening .

source: Mus ledje maid eará astoáiggefálaldagat .
nob: Jeg gikk også på forskjellige fritidstilbud .

source: Doppe lei mus doarjjaolmmoš gii sámástii mearkagielain .
nob: Der hadde jeg en støttekontakt som brukte samisk med tegn .

source: Son lei maiddái mánáidgárddis ja maŋŋil álggii astoáiggeruktui go mun ledjen doppe .
nob: Han var også i barnehagen og senere begynte han på SFO da jeg gikk der .

source: Skuvllas ledje guokte sámegielat oahpaheaddji geat jođiiga mearkagiella-kurssain .
nob: På skolen var det to samiske lærere som gikk på kurs for å lære seg tegnspråk .

source: Muhto mus fertii leat dulka , go giela oahpan lea áddjás hommá .
nob: Men jeg måtte ha tolk , for det tar tid å lære seg et språk .

source: Ožžon dulkka geas lei sáme duogáš ja bealjehis váhnemat .
nob: Jeg fikk tolk som hadde samisk bakgrunn og døve foreldre .

source: [ 1 ] Son hálai dárogiela ja mearkagiela , muhto áddii sámegiela ja muhtumin sámástii mearkagielain .
nob: [ 1 ] Hun pratet norsk og tegnspråk , men forsto samisk og brukte av og til samisk med tegn .

source: Son lei bajásšaddan bealjehisvuođakultuvrrain .
nob: Hun var vokst opp med døvekulturen .

source: Muhto ii lean somá go rávesolmmoš lei mielde olles áiggi go in ádden maid earát dadje .
nob: Men det var ikke morsomt å ha en voksen med seg hele tiden fordi jeg ikke forsto hva de andre sa .

source: Muhto nu lea bealjeheapmin gulli skuvllas .
nob: Men sånn er det å være en døv i en hørende skole .

source: Luohkkáoahpaheaddji ii máhttán mearkagiela , dalle fertejin dulkka geavahit .
nob: Klasselæreren kunne ikke tegnspråk , da måtte jeg bruke tolk .

source: Mánáidskuvllas atnen golbma giela .
nob: Jeg brukte tre språk på barneskolen .

source: Buoremusat muittán buot oktooahpahustiimmuid oahpaheddjiin ja dulkkain .
nob: Det jeg husker best er alle de timene jeg hadde eneundervisning med lærer og tolk .

source: Dat lei veahá láittas .
nob: Det var litt kjedelig .

source: Buoremusat liikojin leat ovttas luohkáin ja buot buoremusat go leimmet mátkkis dahje go mis lei valáštallan olgun .
nob: Jeg likte best å være sammen med klassen og aller best når vi var på turer eller hadde utegym .

source: Dalle in šaddan nu okto .
nob: Jeg ble ikke så alene da.

source: Ja dalle lei stoahkan masa sáhtten oasálastit .
nob: Og da var det lek som jeg kunne være med på .

source: In sáhte muitit ahte mus livččii lean ságastallan máŋgii iežan skihpáriiguin .
nob: Jeg kan ikke huske at jeg hadde mange samtaler med vennene mine .

source: Vuos ledjen sorjavaš dulkkas ja de in sáhttán čuovvut mielde go in lean ádden man birra sii háleštedje .
nob: For det første så var jeg avhengig av tolken og for det andre så kunne jeg ikke henge med fordi jeg ikke hadde fått med meg hva de pratet om .

source: Mus maid ii gávdnon máhttu das man birra sii hálle , go media ja bearraša siskkáldas ságastallamat dáhpáhuvve olggobealde mu .
nob: Jeg hadde heller ikke kunnskap om det de pratet om fordi media og samtaler innen familien hadde gått meg hus forbi .

source: Máŋgii geavai nu ahte munnje čilgejuvvui ášši maŋŋil go dat lei mearriduvvon .
nob: Mange ganger ble det slik at det kom forklaring til meg etter at ting var bestemt .

source: Muittán bures ovtta fearána go vázzen 4. luohkás .
nob: Jeg husker godt en episode da jeg gikk i 4. klasse .

source: Ledjen eahkedis olgun spáppa čiekčamen skihpáriiguin .
nob: Jeg og mine kamerater sparket ball ute på kvelden .

source: Sii hálle ollu , muhto fáhkkestaga válde sihkkeliiddiset ja sihkkelaste eret .
nob: De pratet masse men plutselig tok de syklene sine og syklet av gårde .

source: In ádden gosa sii áigo , danin vulgen ruoktut .
nob: Jeg skjønte ikke hvor de skulle så jeg dro hjem .

source: Maŋŋil bođii okta skihpár ruovttoluotta ja jearai manne mun in lean vuolgán fárrui .
nob: Senere kom en av kameratene mine tilbake og spurte hvorfor jeg ikke ble med .

source: – « Ii , mun in ádden gosa dii áigguidet » , mun vástidin .
nob: –«Nei , jeg skjønte ikke hvor dere skulle » , svarte jeg .

source: Diekkár dáhpáhusat ledje máŋgii .
nob: Slike episoder var det mange av .

source: O. b. Juhan Niillas Eira gárddis .
nob: T. v. Juhan Niillas Eira i reingjerdet

source: ( Govva : ?
nob: ( Foto : ?

source: G. b. Juhan Niillas oaggumin jávrri alde . ( Govva : Linn Sophie Helmersen )
nob: T. h. Juhan Niillas på isfiske ( Foto : Linn Sophie Helmersen )

source: Troandimii fárren
nob: Flytting til Trondheim

source: – Mánáidskuvlla vázzen Kárášjogas .
nob: – Jeg gikk barneskolen i Karasjok .

source: Go galgen nuoraidskuvlii álgit , in ožžon dulkka .
nob: Da jeg skulle begynne på ungdomsskolen fikk jeg ikke tolk .

source: Dulka fárrii gilis eret ja oahpaheaddjit mat mus ledje mánáidskuvllas eai čuvvon mu nuoraidskuvlii .
nob: Tolken flyttet fra bygda og lærerne som jeg hadde på barneskolen fulgte ikke med til ungdomsskolen .

source: Čoavddusin gárttai Troanddin ja bealjehemiid skuvla .
nob: Løsningen ble Trondheim og døveskolen .

source: Kárášjogas in sáhttán čađahit nuoraidskuvlla dulkka haga .
nob: I Karasjok kunne jeg ikke gjennomføre ungdomsskolen uten tolk .

source: Gielda gal lei dieđihan virggi rabas , muhto eai leat gallis geat hálddašit sihke sáme- ja mearkagiela .
nob: Kommunen hadde lyst ut en stilling , men det er ikke mange som behersker både samisk og tegnspråk .

source: Ii oktage ohcan dan virggi .
nob: Det var ingen som søkte på stillingen .

source: Sirdašupmi Kárášjogas roanddimii lei stuoris .
nob: Overgangen fra Karasjok til Trondheim var stor .

source: Jurddaš ahte Kárášjogas ásaimet viesus gos eanáš siidaguoimmit gulle boazodollui ja buohkat dovde buohkaid .
nob: Tenk at vi bodde i et hus i Karasjok hvor de fleste naboene var i reindrifta og alle kjent hverandre .

source: De gárttaimet geardedálu ásodahkii lahka A. C. Møller skuvlla , nappo bealjehemiid skuvlla .
nob: Så havnet vi i en blokkleilighet nær A. C. Møller skole , altså døveskolen .

source: Ledjen veahá váivvis guođđit gili , bearraša ja ustibiid , muhto ilus go fas deiven bealjehis skihpáriid geaidda ledjen oahpásmuvvan go orron oanehis bottaid bealjehemiid skuvllas .
nob: Jeg var litt lei meg for å forlate bygda , familie og venner , men glad for å treffe mine døve venner som jeg hadde møtt under korttidsopphold på døveskolen .

source: Ii lean dušše ássanbiras- ja kultuvrrarievdan mii lei váttis .
nob: Det var ikke bare det å endre bomiljø og kultur som var vanskelig .

source: Munnje lei maid váttis áddet dárogiela ja fertejin álgit masá áibba álggus .
nob: Jeg hadde vanskeligheter med å forstå norsk og måtte begynne fra start nesten .

source: Mu luohkkálaččat ledje joavdan ollu guhkkelebbui go mun .
nob: De i klassen min hadde kommet mye lengre enn meg .

source: Dasa lassin ii sámegiella joatkašuvvan fágan bealjehemiid skuvllas .
nob: Dessuten ble ikke samisk videreført som fag på døveskolen .

source: Diesa dat bisánii , ja mun in goassige oahppan čállit ja lohkat sámegiela albma láhkái .
nob: Der ble det stopp og jeg lærte aldri å skrive og lese samisk skikkelig .

source: Nubbi ášši lei ahte in lean hárjánan gulahallat mearkagielain máŋggaiguin oktanaga .
nob: En annen ting var også at jeg ikke var vant til å kommunisere på tegnspråk med mange av gangen .

source: Ádjánii ovdal go hárjánin oasálastit ságastallamiidda ja leat mielde dahkamen mearrádusaid .
nob: Det tok tid å venne seg til å være med i diskusjoner og å være med på å bestemme .

source: Lihkus hárjánin jođánit atnit mearkagiela máŋggaiguin ja farga dovden gullevašvuođa earáiguin .
nob: Heldigvis så gikk det fort å bli vant til å bruke tegnspråk med flere og jeg følte meg fort som en av de andre .

source: Lean bealjeheapmi ja lei ge geahppasat vázzit bealjehemiid skuvlla go « gulli » skuvlla .
nob: Jeg er døv og det var jo lettere å gå på en døveskole enn å gå på « hørende » skole .

source: « Gulli » skuvllas buot hálešteapmi geavvá dulkkain , ja dat ii leat álo nu somá .
nob: På en « hørende » skole skjer all prat via tolk og det er ikke bestandig morsomt .

source: Munnje lei dehálaš doallat oktavuođa ruovttubirrasiin Kárášjogas , de rihppaskuvlla áiggi šattai nu ahte čuvvon rihppaskuvlaoahpahusa Troandimis ja de bessen konfirmerejuvvot ruovttus Kárášjogas .
nob: Det var viktig for meg å opprettholde kontakten med hjemmemiljøet i Karasjok , så under konfirmasjonstiden ble det slik at jeg fulgte undervisningen i Trondheim og fikk konfirmere meg hjemme i Karasjok .

source: Lei munnje mávssolaš ja buorre konfirmerejuvvot ovttas ustibiiguin ja bearrašiin .
nob: Det var stas og det var godt å bli konfirmert sammen med mine venner og familie .

source: Sihke bealjehemiidbáhppa ja bealjehemiiddulka leigga doppe .
nob: Det var både døveprest og tolk tilstede .

source: Joatkkaoahppu
nob: Videre utdanning

source: – Go ledjen skuvllas geargan mearridin vázzit huksejeaddji-suorggi Tiller joatkkaskuvllas .
nob: – Da jeg var ferdig med skolen bestemte jeg meg for å gå på tømrerlinja på Tiller videregående skole .

source: Dat lea joatkkaskuvla gos vázzet ollu bealjeheamit ja sis leat máŋga dulkka barggus skuvllas .
nob: Det er en videregående skole med flere døve og de har mange tolker ansatt på skolen .

source: Huksejeaddji- suorggis ledjen dušše mun bealjeheapmin ja geavahin dulkka .
nob: På tømrerlinja var det bare jeg som var døv og brukte tolk .
